Tekla Open API Reference for Tekla Structures 2025
IIsEqual Methods
The IIsEqual type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
Top
See Also
Reference
IIsEqual Interface
Tekla.Structures.Drawing Namespace